taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
      <!-- ******************************  XMC1100-Q024x0064  ****************************** -->
      <device Dname="XMC1100-Q024x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q024x0064"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_02-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_07-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_03-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>
      </device>

      <!-- ******************************  XMC1100-Q040x0064  ****************************** -->
      <device Dname="XMC1100-Q040x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_Q040x0064"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_02-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_07-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_03-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>
      </device>

      <!-- ******************************  XMC1100-T016x0064  ****************************** -->
      <device Dname="XMC1100-T016x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T016x0064"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_02-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_07-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_03-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>
      </device>

      <!-- ******************************  XMC1100-T038x0064  ****************************** -->
      <device Dname="XMC1100-T038x0064">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1100_series/Include/XMC1100.h"  define="XMC1100_T038x0064"/>
        <debug      svd="SVD/XMC1100.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1100_64.FLM"     start="0x10001000"  size="0x10000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1100-AB_rm-UM-v01_02-EN.pdf"   title="XMC1100 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1100_AB-DS-v01_07-EN.pdf"      title="XMC1100 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1100_AB-ES-v01_03-EN.pdf"      title="XMC1100 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>
      </device>     
      </subFamily>

      <!-- ************************  Subfamily 'XMC1200'  **************************** -->
      <subFamily DsubFamily="XMC1200 Series">
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="ComOther"      n="2"                         name="Universal Serial Interface"/>
        
      <!-- ******************************  XMC1201-Q040x0016  ****************************** -->
      <device Dname="XMC1201-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1201_Q040x0016"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_02-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_07-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_03-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>      
      </device>

      <!-- ******************************  XMC1201-T028x0016  ****************************** -->
      <device Dname="XMC1201-T028x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1201_T028x0016"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_02-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_07-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_03-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="SOP"           n="28"/>      
      </device>

      <!-- ******************************  XMC1201-T028x0032  ****************************** -->
      <device Dname="XMC1201-T028x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1201_T028x0032"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_02-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_07-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_03-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="SOP"           n="28"/>      
      </device>

      <!-- ******************************  XMC1201-T038x0016  ****************************** -->
      <device Dname="XMC1201-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1200_series/Include/XMC1200.h"  define="XMC1201_T038x0016"/>
        <debug      svd="SVD/XMC1200.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1200_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1200-AB_rm-UM-v01_02-EN.pdf"   title="XMC1200 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1200_AB-DS-v01_07-EN.pdf"      title="XMC1200 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1200_AB-ES-v01_03-EN.pdf"      title="XMC1200 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>          
      </device>

