taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
      <!-- ******************************  XMC1301-T016x0032  ****************************** -->
      <device Dname="XMC1301-T016x0032">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1301_T016x0032"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

        
      <!-- ******************************  XMC1302-T016x0008  ****************************** -->
      <device Dname="XMC1302-T016x0008">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T016x0008"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1302-T028x0016  ****************************** -->
      <device Dname="XMC1302-T028x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T028x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>  
      </device>

      <!-- ******************************  XMC1302-Q024x0016  ****************************** -->
      <device Dname="XMC1302-Q024x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q024x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="22"/>
        <feature type="QFN"           n="24"/>
      </device>

      <!-- ******************************  XMC1302-Q040x0016  ****************************** -->
      <device Dname="XMC1302-Q040x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_Q040x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="QFN"           n="40"/>
      </device>

      <!-- ******************************  XMC1302-T016x0016  ****************************** -->
      <device Dname="XMC1302-T016x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T016x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="14"/>
        <feature type="SOP"           n="16"/>        
      </device>

      <!-- ******************************  XMC1302-T038x0016  ****************************** -->
      <device Dname="XMC1302-T038x0016">
        <processor Dclock="32000000"/>
        <compile header="Device/XMC1300_series/Include/XMC1300.h"  define="XMC1302_T038x0016"/>
        <debug      svd="SVD/XMC1300.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1300_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-xmc1300-AB_rm-UM-v01_02-EN.pdf"   title="XMC1300 Series Reference Manual"/>
        <book    name="Documents/Infineon-xmc1300_AB-DS-v01_07-EN.pdf"      title="XMC1300 Series Step Data Sheet"/>
        <book    name="Documents/Infineon-xmc1300_AB-ES-v01_03-EN.pdf"      title="XMC1300 Series Errata Sheet"/> 
        <book    name="Device/XMClib/doc/XMC1_Peripheral_Library.chm"       title="XMC1 Peripheral Library"/>  
        <feature type="IOs"           n="34"/>
        <feature type="SOP"           n="38"/>        
      </device>

