taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
  <boards>
    <board vendor="Infineon" name="XMC1100 Boot Kit" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/456/xmc1100-boot-kit-kit_xmc11_boot_001?c=154">
      <description>Infineon XMC1100 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1100_small.jpg" large="Images/XMC1100_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontrollers/32-bit-industrial-microcontrollers-based-on-arm-registered-cortex-tm-m/32-bit-xmc1000-industrial-microcontrollers-arm-registered-cortex-tm-m0/xmc1000-starter-kits/boot-kit-xmc1100/channel.html?channel=db3a30433cfb5caa013d115dda020665" title="XMC1100 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1100_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1100_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1100-T038x0064"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1100 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="18"             name="Pins at IOH, 8 pins at IOL (Arduino)"/>
        <feature type="DIO"       n="5"              name="Pins at AUX (non-Arduino)"/>
        <feature type="AIO"       n="6"              name="Analog inputs at AD (Arduino)"/>
        <feature type="AIO"       n="2"              name="Analog inputs at AD_AUX (non-Arduino)"/>
        <feature type="SPI"       n="1"              name="In-Circuit Serial Programming Header"/>
        <feature type="LED"       n="6"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>

    <board vendor="Infineon" name="XMC1200 Boot Kit" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc1200-boot-kit-kit_xmc12_boot_001?c=154">
      <description>Infineon XMC1200 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1200_small.jpg" large="Images/XMC1200_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontrollers/32-bit-industrial-microcontrollers-based-on-arm-registered-cortex-tm-m/32-bit-xmc1000-industrial-microcontrollers-arm-registered-cortex-tm-m0/xmc1000-starter-kits/boot-kit-xmc1200/channel.html?channel=db3a30433cfb5caa013d115e72290668" title="XMC1200 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1200_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1200_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1200_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1201-T038x0200"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1200 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>

    <board vendor="Infineon" name="XMC1300 Boot Kit" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc1200-boot-kit-kit_xmc12_boot_001?c=154">
      <description>Infineon XMC1300 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1300_small.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontrollers/32-bit-industrial-microcontrollers-based-on-arm-registered-cortex-tm-m/32-bit-xmc1000-industrial-microcontrollers-arm-registered-cortex-tm-m0/xmc1000-starter-kits/boot-kit-xmc1200/channel.html?channel=db3a30433cfb5caa013d115e72290668" title="XMC1200 Boot Kit Web Page"/>
      <book category="setup"     name="Documents/XMC1300_Boot_Kit_Getting_Started_v1_2.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_XMC1300_CPU_Card_V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC1300_CPU_Card_R2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1302-T038x0200"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1300 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>
     
