taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
    <example name="CAN_LOOPBACK" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CAN/CAN_LOOPBACK">
      <description>CMSIS DRIVER CAN LOOPBACK example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_LOOPBACK.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="CAN_TRANSMIT" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CAN/CAN_TRANSMIT">
      <description>CMSIS DRIVER CAN TRANSMIT example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="CAN_TRANSMIT.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS Driver" Cgroup="CAN"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <!-- Infineon XMC1 Low Level Driver (LLD) Examples -->
    <!-- ANACMP -->    
    <example name="ANACMP" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/ANACMP/ACMP_CMP">
      <description>XMClib ANACMP example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="ANACMP" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/ANACMP/ACMP_CMP">
      <description>XMClib ANACMP example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- BCCU -->    
    <example name="BCCU" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/BCCU/BCCU_LED">
      <description>XMClib BCCU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/bccu_led.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="BCCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CCU4 -->    
    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CCU4/CCU4_TIMER">
      <description>XMClib CCU4 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CAN -->    
    <example name="CAN" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CAN/CAN_LOOPBACK_EXT_OSC">
      <description>XMClib CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_loopback_ext_osc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU8 -->    
    <example name="CCU8" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU8/CCU8_TIMER">
      <description>XMClib CCU8 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

