taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
    <!-- VADC -->  
    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/VADC/VADC_MEASUREMENT">
      <description>XMClib VADC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- WDT -->  
    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/WDT/WDT_FEED">
      <description>XMClib WDT example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
                              
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="XMC1 CMSIS">
      <description>System Startup for Infineon XMC1000 device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC1100_series/Include/"  condition="XMC11xx"/>
        <file category="include" name="Device/XMC1200_series/Include/"  condition="XMC12xx"/>
        <file category="include" name="Device/XMC1300_series/Include/"  condition="XMC13xx"/>
        <file category="include" name="Device/XMC1400_series/Include/"  condition="XMC14xx"/>
        
       <!-- startup files -->
        <file category="source" name="Device/XMC1100_series/Source/ARM/startup_XMC1100.s" attr="config"      version="1.4.0" condition="XMC11xx ARM"/>
        <file category="source" name="Device/XMC1200_series/Source/ARM/startup_XMC1200.s" attr="config"      version="1.4.0" condition="XMC12xx ARM"/>
        <file category="source" name="Device/XMC1300_series/Source/ARM/startup_XMC1300.s" attr="config"      version="1.4.0" condition="XMC13xx ARM"/>  
        <file category="source" name="Device/XMC1400_series/Source/ARM/startup_XMC1400.s" attr="config"      version="1.0.0" condition="XMC14xx ARM"/> 

        <file category="source" name="Device/XMC1100_series/Source/IAR/startup_XMC1100.s" attr="config"      version="1.20.0" condition="XMC11xx IAR"/>
        <file category="source" name="Device/XMC1200_series/Source/IAR/startup_XMC1200.s" attr="config"      version="1.20.0" condition="XMC12xx IAR"/>
        <file category="source" name="Device/XMC1300_series/Source/IAR/startup_XMC1300.s" attr="config"      version="1.20.0" condition="XMC13xx IAR"/>  
        <file category="source" name="Device/XMC1400_series/Source/IAR/startup_XMC1400.s" attr="config"      version="1.20.0" condition="XMC14xx IAR"/> 

        <file category="source" name="Device/XMC1100_series/Source/GCC/startup_XMC1100.S" attr="config"      version="1.15.0" condition="XMC11xx GCC"/>
        <file category="source" name="Device/XMC1200_series/Source/GCC/startup_XMC1200.S" attr="config"      version="1.15.0" condition="XMC12xx GCC"/>
        <file category="source" name="Device/XMC1300_series/Source/GCC/startup_XMC1300.S" attr="config"      version="1.15.0" condition="XMC13xx GCC"/>  
        <file category="source" name="Device/XMC1400_series/Source/GCC/startup_XMC1400.S" attr="config"      version="1.1.0" condition="XMC14xx GCC"/> 
        
        <!-- system file -->      
        <file category="source" name="Device/XMC1100_series/Source/system_XMC1100.c"      attr="config"      version="1.9.0" condition="XMC11xx"/>
        <file category="source" name="Device/XMC1200_series/Source/system_XMC1200.c"      attr="config"      version="1.9.0" condition="XMC12xx"/>
        <file category="source" name="Device/XMC1300_series/Source/system_XMC1300.c"      attr="config"      version="1.9.0" condition="XMC13xx"/>
        <file category="source" name="Device/XMC1400_series/Source/system_XMC1400.c"      attr="config"      version="1.1.0" condition="XMC14xx"/>
        
        <!-- linker files -->
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0008.ld"  version="1.9.0" condition="XMC11xx_0008_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0016.ld"  version="1.9.0" condition="XMC11xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0032.ld"  version="1.9.0" condition="XMC11xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1100_series/Source/GCC/XMC1100x0064.ld"  version="1.9.0" condition="XMC11xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0016.ld"  version="1.10.0" condition="XMC12xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0032.ld"  version="1.9.0" condition="XMC12xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0064.ld"  version="1.10.0" condition="XMC12xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0128.ld"  version="1.9.0" condition="XMC12xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1200_series/Source/GCC/XMC1200x0200.ld"  version="1.9.0" condition="XMC12xx_0200_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0008.ld"  version="1.9.0" condition="XMC13xx_0008_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0016.ld"  version="1.10.0" condition="XMC13xx_0016_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0032.ld"  version="1.10.0" condition="XMC13xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0064.ld"  version="1.9.0" condition="XMC13xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0128.ld"  version="1.9.0" condition="XMC13xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1300_series/Source/GCC/XMC1300x0200.ld"  version="1.10.0" condition="XMC13xx_0200_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0032.ld"  version="1.4.0" condition="XMC14xx_0032_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0064.ld"  version="1.4.0" condition="XMC14xx_0064_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0128.ld"  version="1.4.0" condition="XMC14xx_0128_GCC"/>
        <file category="linkerScript" name="Device/XMC1400_series/Source/GCC/XMC1400x0200.ld"  version="1.4.0" condition="XMC14xx_0200_GCC"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.1.0" condition="XMC1 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>      
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1100_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1100_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1100_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1100_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1200_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T28/RTE_Device.h" version="1.1.0" condition="XMC1201_T28" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1201_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1201_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1202_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T28/RTE_Device.h" version="1.1.0" condition="XMC1202_T28" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1202_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1202_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1301_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1301_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1301_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1301_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" version="1.1.0" condition="XMC1302_T16" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" version="1.1.0" condition="XMC1302_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" version="1.1.0" condition="XMC1302_Q24" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" version="1.1.0" condition="XMC1302_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" version="1.1.0" condition="XMC1401_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1401_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_T38/RTE_Device.h" version="1.1.0" condition="XMC1402_T38" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q40/RTE_Device.h" version="1.1.0" condition="XMC1402_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" version="1.1.0" condition="XMC1402_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1402_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" version="1.1.0" condition="XMC1402_F64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q40/RTE_Device.h" version="1.1.0" condition="XMC1403_Q40" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q48/RTE_Device.h" version="1.1.0" condition="XMC1403_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1403_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q48/RTE_Device.h" version="1.1.0" condition="XMC1404_Q48" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1404_Q64" attr="config"/>
        <file category="header"  name="RTE_Driver/Config/XMC1403_Q64/RTE_Device.h" version="1.1.0" condition="XMC1404_F64" attr="config"/>
        </files>
    </component>
        
    <!-- START: Infineon Standard Peripherals Low Level Drivers -->
   
