taboadaa/ShuQi/nRF/Packages/.cache/Infineon.XMC1000_DFP.2.5.1.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.00" Cversion="1.00" condition="XMC1 CMSIS Driver SAI">
      <description>SAI Driver for XMC1000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SAI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/SAI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.00" Cversion="1.00" condition="XMC1 CMSIS Driver CAN">
      <description>CAN Driver for XMC1000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/CAN.c"/>
      </files>
    </component>
    
    <!-- END: CMSIS Peripherals Drivers -->

    <!-- Board Support Pack (BSP) for XMC1100 XMC2GO Kit -->   
    <bundle Cbundle="XMC1100 XMC2GO Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1100 XMC2GO Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC_2Go_Kit_with_XMC1100_R1.0.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1100 XMC2GO Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC_2Go/Common/LED.c"/>
        </files>
      </component>
    </bundle>

    <!-- Board Support Pack (BSP) for XMC1100 Boot Kit -->   
    <bundle Cbundle="XMC1100 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1100 Boot Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1100 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1100 Boot Kit/Common/LED.c"/>
        </files>
      </component>
    </bundle>

    <!-- Board Support Pack (BSP) for XMC1200 Boot Kit -->   
    <bundle Cbundle="XMC1200 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1200 Boot Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1200 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1200 Boot Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="A/D Converter" condition="XMC1 HAL VADC">
        <description>A/D Converter interface for XMC1200 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1200 Boot Kit/Common/ADC.c"/>
        </files>
      </component>
    </bundle>

    <!-- Board Support Pack (BSP) for XMC1300 Boot Kit -->   
    <bundle Cbundle="XMC1300 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1300 Boot Kit Board Support</description>    
      <doc>Documents/Board_Users_Manual_XMC1100_CPU_Card_R2.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1300 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1300 Boot Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="A/D Converter" condition="XMC1 HAL VADC">
        <description>A/D Converter interface for XMC1300 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1300 Boot Kit/Common/ADC.c"/>
        </files>
      </component>
    </bundle>

    <!-- Board Support Pack (BSP) for XMC1400 Boot Kit -->   
    <bundle Cbundle="XMC1400 Boot Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC1400 Boot Kit Board Support</description>    
      <doc>Documents/Infineon-Board_Users_Manual_XMC1400_Boot_Kit.pdf-UM-v01_00-EN.pdf</doc>    
      <component Cgroup="LED" condition="XMC1 HAL GPIO">
        <description>LED driver for XMC1400 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1400 Boot Kit/Common/LED.c"/>
        </files>
      </component>                        
      <component Cgroup="A/D Converter" condition="XMC1 HAL VADC">
        <description>A/D Converter interface for XMC1400 Boot Kit</description>
        <files>
          <file category="source" name="Boards/Infineon/XMC1400 Boot Kit/Common/ADC.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
